#include<iostream>
using namespace std;

int main()
{
	setlocale(LC_ALL, "rus");

	int d = 0;
	int t = 0;
	cout << "Введите число от 1 до 7, которое должен угадать ваш противник:\n";

	for ( ; ; )
	{
		cin >> d;
		if (d>=1 && d <=7)
		{
			break;
		}
		else
		{
			cout << "Неправильный диапазон! Введите число от 1 до 7: ";
		}
	}
	system("cls");  //ф-я запомнит число и очистит экран. Только в Windows
	cout << "Попробуйте угадать число, которое загадал ваш оппонент.\n";
	cout << "Это целое число от 1 до 7. Введите ваш вариант ответа: ";
	for (int q = 1; ; q++)
	{
		cin >> t;
		if (t < 1 || t>7)
		{
			q--;
			cout << "Введите число в диапазоне от 1 до 7: ";
		}
		else if(d==t)
		{
			cout << "Поздравляем! Вы угадали число с " << q << "-й попытки!\n\n";
			break;
		}
		else
		{
			cout << "Вы не угадали! Попробуйте ещё раз: ";
		}
	}
	return 0;
}